[
  {
    "path": "posts/welcome/",
    "title": "Salto de fe: de cómo transicioné de Windows a Linux",
    "description": "En este pequeño artículo hablaré de los problemas más recurrentes que he tuve con Windows 10, mi experiencia con Linux hasta este momento, y un par de recomendaciones y fuentes por si te interesa dejar de usar Windows.",
    "author": [
      {
        "name": "Gonzalo Martínez",
        "url": {}
      }
    ],
    "date": "2021-01-07",
    "categories": [],
    "contents": "\n¿Cuántas veces no has estado al borde del colapso nervioso porque windows se tarda años en abrir un programa, porque quiere actualizarse justo cuando ya te vas a dormir, o simplemente porque instala y reinstala programas que no quieres (coff coff Edge coff coff)? Como una de las millones de personas fastidiadas por estos y otros problemas con Windows es que decidí dar el salto de fe al mundo de Linux.\nEl inicio del fin\nComo muchos de los millenials urbanos y con acceso a una computadora, mi integración al mundo digital inició con Windows, y salvo por una breve experimentación con ubuntu en mi adolescencia, nunca había usado otro sistema operativo. Una de las razones por las que he estado confinado a Windows es que linux y sus múltiples distribuciones no son muy conocidas para lxs usuarios casuales (por hacer una analogía con la jerga gamer) en oposición a los usuarios con mayor experiencia, interés, o habilidad en informática. Otra razón es que, en la percepción de estos mismos usuarios, la idea de utilizar la computadora a través de algo que no sea una interfaz gráfica (o Graphical User Interface en inglés) produce un sudor de manos y poco interés. En mi caso nunca se me había ocurrido usar Linux porque sentía que no contaba con el conocimiento y la capacidad para configurar y usar un sistema operativo que requiriera algo más que unos cuantos clicks ¿Qué cambió entonces?\n\n\n\nFigure 1: ¡Alerta de Spoiler!: En la más reciente película de Spiderman, Miles Morales descubre que lo que necesita para poder dominar sus habilidades es confiar en sí mismo y simplemente hacer las cosas.\n\n\n\nMi transición hacia el software libre ha sido gradual y poco perceptible. Los primeros pasos los di desde la academia cuando cursaba mis estudios de licenciatura en biología. Tanto en las ciencias biológicas como en las ciencias sociales la estadística no sólo ha sido fundamental en el desarrollo de sus métodos, sino también en la consolidación de algunas de sus ramas (como la ecología) como ciencias ante los ojos del otras disciplinas tales como la física o las matemáticas. Es por ello que uno de los cursos con más valor es el de bioestadística, en donde se nos introduce a la estadística y sus aplicaciones empleando programas con interfaces gráficas Stata o SPSS por un lado, y R por el otro. Incontables biólogas y biólogos han derramado sudor y lágrimas por verse obligados a usar R para sus clases o sus tesis; mientras que otros desarrollamos una variante de Síndrome de Estocolmo y le empezamos a agarrar el gusto a lidiar constantemente con errores (muchas veces triviales). Al ir desarrollando dicho síndrome también fui ganando habilidades para buscar soluciones a los problemas con mis análisis que me fueron útiles para otros programas y dispositivos.\nDurante mis estudios de maestría comencé a conocer más sobre las implicaciones políticas de las licencias de software y los derechos de autor en la creación y distribución del conocimiento. Como muchos otros estudiantes a lo largo del mundo, yo no hubiese acceder a mucha de la literatura que consulté de no haber sido gracias a Sci Hub o la Library Genesis. Las declaraciones de estas iniciativas encendieron mi interés y me dieron una razón más estructurada para transicionar hacia el software libre en la medida de lo posible.\n\n\n\nFigure 2: En años pasados Elsevier, una de las editoriales científicas mñas poderosas demandó a Scie Hub por derechos de autor, obligando a su creadora a mudarse a Rusia.\n\n\n\n\nFigure 3: En años pasados Elsevier, una de las editoriales científicas mñas poderosas demandó a Scie Hub por derechos de autor, obligando a su creadora a mudarse a Rusia.\n\n\n\nEntrando al pasillo de los dulces\nA inicios del año pasado aproveché el encierro para investigar sobre Linux y explorar qué tan difícil en realidad era. Lo primero con lo que me topé fue con una asombrosa diversidad de distribuciones que existen, desde Linux Mint y Ubuntu hasta Red Hat y Arch linux. Como un potencial usuario novato y asustado, inicé buscando las distribuciones más populares y que requerían menos de la línea de comandospara configurar el sistema. Los resultados constriñeron la decisión a Linux Mint, Ubuntu, y Manjaro; siendo este último el ganador.\n\n\n\nFigure 4: Logos de las distribuciones Linux Mint, Ubuntu, y Manjaro\n\n\n\nMi decisión por usar Manjaro se debió a varios factores, entre los que destacan:\nManjaro es una distribución construida a partir de Arch Linux, el cual no requiere demasiado recursos de la computadora lo que lo hace ideal para mi laptop de más de tres años.\nEl sistema es amigable con usuarios nuevos en general, y se instala mediante un instalador gráfico independiente llamado Calamares que te lleva paso a paso como el Wizard de instalación en Windows. De manera similar, la instalación de programas se puede hacer a través el instalador gráfico Pamac.\nManjaro, a diferencia de varias distribuciones de Linux que sólo son mantenidas por una comunidad, tiene como finalidad convertirse en un sistema operativo profesional que le permita competir con Windows y MacOS. De hecho, los desarrolladores han logrado conseguir convenios con los fabricantes de hardware para que la integración con Manjaro sea total.\nDe nuevo, al estar basada en Arch linux, los usuarios de Manjaro podemos echar mano de la [Wiki](https://wiki.archlinux.org/index.php/Main_page_(Espa%C3%B1ol) y de los repositorios mantenidos por la comunidad. Pero además, la comunidad en los foros es bastante amable y es fácil encontrar una solución a los problemas.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-11T22:24:59-06:00",
    "input_file": "welcome.utf8.md"
  }
]
